import Answer from "../models/Answer";
import Course from "../models/Course";
import Exam from "../models/Exam";
import Lesson from "../models/Lesson";
import Question from "../models/Question";
import User from "../models/User";

export const USERS = [
    new User(1, "09155613393"),
    new User(2, "09155613394"),
    new User(3, "09155613395"),
    new User(4, "09155613396"),
    new User(5, "09155613397"),
];

export const LESSONS = [
    new Lesson(1, "مدنی"),
    new Lesson(2, "پایگاه داده"),
    new Lesson(3, "جغرافیا"),
    new Lesson(4, "تاریخ"),
    new Lesson(5, "زیست"),
    new Lesson(6, "فیزیک"),
    new Lesson(7, "شیمی"),
    new Lesson(8, "عربی"),
    new Lesson(9, "دینی"),
    new Lesson(10, "گسسته"),
];

export const COURSES = [
    new Course(1, "هفتم", [1, 2]),
    new Course(2, "هشتم", [3, 2, 5]),
    new Course(3, "نهم", [1, 4, 6]),
    new Course(4, "دهم", [7, 10]),
    new Course(5, "یازدهم", [9, 2, 8]),
    new Course(6, "دوازدهم", [4, 5, 10]),
];

export const EXAMS = [
    new Exam(1, 20, "25/1/2023 10:00", "25/1/2023 12:00", "در انتظار شروع", 3, 1, 1),
    new Exam(2, 10, "26/1/2023 11:00", "26/1/2023 13:00", "در حال برگزاری", 3, 2, 2),
    new Exam(3, 5, "27/1/2023 18:00", "27/1/2023 19:00", "در انتظار شروع", 2, 3, 3),
    new Exam(4, 10, "28/1/2023 20:00", "28/1/2023 22:00", "لغو شده", 3, 4, 4),
    new Exam(5, 15, "24/1/2023 20:00", "24/1/2023 23:00", "در حال برگزاری", 3, 5, 6),
    new Exam(6, 10, "29/1/2023 20:20", "29/1/2023 22:00", "لغو شده", 3, 6, 7),
    new Exam(7, 8, "30/1/2023 20:30", "30/1/2023 22:00", "در انتظار شروع", 3, 4, 9),
    new Exam(8, 4, "20/1/2023 20:15", "20/1/2023 22:00", "لغو شده", 3, 1, 8),
    new Exam(9, 12, "25/1/2023 21:00", "25/1/2023 22:00", "در حال برگزاری", 3, 2, 10),
];

export const QUESTIONS = [
    new Question(
        1,
        "بر اساس قانون بیمه اجباری مسئولیت مدنی دارندگان وسایل نقلیه موتوری زمینی در مقابل شخص ثالث خسارت کدام یک از اشخاص زیر، جبران نخواهد شد؟",
        [1],
        "",
        ""
    ),
    new Question(2, "مالک زمینی به موجب قرارداد صلح، به همسایه حق عبور از ملک خود را داده است. کدام مورد صحیح است؟", [1], "", ""),
    new Question(
        3,
        "زوج در حال بیماری، همسر خود را طلاق می دهد و ۶ ماه بعد، در نتیجه همان بیماری فوت می کند. زن که ۱۴ ماه پس از طلاق ازدواج کرده است، مطالبه سهم الارث می نماید. کدام مورد، صحیح است؟",
        [1],
        "",
        ""
    ),
    new Question(4, "معماری توزیع شده در انواع معماری DBMS چیست؟", [2], "", ""),
    new Question(5, "کدامیک از گزینه‌های زیر جزو عنصرهای اصلی پایگاه داده به حساب نمی‌آید؟", [2], "", ""),
    new Question(6, "منظور از خاصیت یکپارچگی در خواص ACID چیست ؟", [2], "", ""),
    new Question(7, "کدام سوال جغرافیایی به بررسی سیر تکوین وتحول پدیده می پردازد ؟", [3], "", ""),
    new Question(8, "شکل نهایی ناهمواریهای کشور ایران در چه دوره ای ایجاد شده است ؟", [3], "", ""),
    new Question(9, "با فزایش هر 1000متر ارتفاع در الیه تروپوسفرچند در جه هوا کاهش می یابد ؟", [3], "", ""),
];

export const ANSWERS = [
    new Answer(1, "هر دو که به اشتراک انجام می‌دهند", [1], true, ""),
    new Answer(
        2,
        "گر خرابی مجرا مانع عبور آب شود، تعمیر آن به عهده کسی است که آب می‌برد، ولی اگر خرابی سبب خسارت به خانه باشد دفع ضرر به عهده مالک خانه است",
        [1],
        false,
        ""
    ),
    new Answer(2, "صرف بریات می شود", [1], false, ""),
    new Answer(1, "صرف تحقیق و تبلیغ و نشر کتب در زمینه معارف اسلامی", [1], false, ""),
    new Answer(3, " تمامی آثارش ظاهر می‌شود", [2], true, ""),
    new Answer(4, "هنوز عقد وجود حقوقی پیدا نکرده است", [2], false, ""),
    new Answer(5, "هیچ اثری ندارد", [2], false, ""),
    new Answer(6, "مفاد نامه خرید بازرگان ایجاب تلقی شده و پس از قبول مدیر شرکت عقد به طور صحیح منعقد می شود", [2], false, ""),
    new Answer(7, "معامله معلق و مطلق واقع می شود.", [3], false, ""),
    new Answer(8, "معامله ای واقع نمی شود", [3], false, ""),
    new Answer(9, "معامله غیرنافذ است", [3], true, ""),
    new Answer(10, "مفاد نامه خرید بازرگان ایجاب تلقی شده و پس از قبول مدیر شرکت عقد به طور صحیح منعقد می شود", [3], false, ""),
    new Answer(11, "شخصاً ولو با تحمل مشقت بسیار قادر به دفع تهدید باشد", [4], false, ""),
    new Answer(12, " تهدیدکننده بعد از عقد اعلام کند قصد اجرای تهدید را نداشته است", [4], true, ""),
    new Answer(13, "تهدید شده بداند که تهدیدکننده نمی‌تواند تهدید خود را به موقع اجرا گذارد", [4], false, ""),
    new Answer(14, "مفاد نامه خرید بازرگان ایجاب تلقی شده و پس از قبول مدیر شرکت عقد به طور صحیح منعقد می شود", [4], false, ""),
    new Answer(15, "شخصاً ولو با تحمل مشقت بسیار قادر به دفع تهدید باشد", [5], false, ""),
    new Answer(16, " شخصاً ولو با تحمل مشقت بسیار قادر به دفع تهدید باشد", [5], true, ""),
    new Answer(17, "تهدید شده بداند که تهدیدکننده نمی‌تواند تهدید خود را به موقع اجرا گذارد", [5], false, ""),
    new Answer(18, "مفاد نامه خرید بازرگان ایجاب تلقی شده و پس از قبول مدیر شرکت عقد به طور صحیح منعقد می شود", [5], false, ""),
    new Answer(19, "شخصاً ولو با تحمل مشقت بسیار قادر به دفع تهدید باشد", [6], false, ""),
    new Answer(20, " تهدیدکننده بعد از عقد اعلام کند قصد اجرای تهدید را نداشته است", [6], false, ""),
    new Answer(21, "تهدید شده بداند که تهدیدکننده نمی‌تواند تهدید خود را به موقع اجرا گذارد", [6], true, ""),
    new Answer(22, "مفاد نامه خرید بازرگان ایجاب تلقی شده و پس از قبول مدیر شرکت عقد به طور صحیح منعقد می شود", [6], false, ""),
    new Answer(23, "شخصاً ولو با تحمل مشقت بسیار قادر به دفع تهدید باشد", [7], false, ""),
    new Answer(24, " تهدیدکننده بعد از عقد اعلام کند قصد اجرای تهدید را نداشته است", [7], true, ""),
    new Answer(25, "تهدید شده بداند که تهدیدکننده نمی‌تواند تهدید خود را به موقع اجرا گذارد", [7], false, ""),
    new Answer(26, "مفاد نامه خرید بازرگان ایجاب تلقی شده و پس از قبول مدیر شرکت عقد به طور صحیح منعقد می شود", [7], false, ""),
    new Answer(27, "شخصاً ولو با تحمل مشقت بسیار قادر به دفع تهدید باشد", [8], false, ""),
    new Answer(28, " تهدیدکننده بعد از عقد اعلام کند قصد اجرای تهدید را نداشته است", [8], true, ""),
    new Answer(29, "معامله برای خود وکیل واقع شده است", [8], false, ""),
    new Answer(30, " معامله برای اصیل واقع شده است", [8], false, ""),
    new Answer(31, "شخصاً ولو با تحمل مشقت بسیار قادر به دفع تهدید باشد", [9], false, ""),
    new Answer(32, " تهدیدکننده بعد از عقد اعلام کند قصد اجرای تهدید را نداشته است", [9], true, ""),
    new Answer(33, "معامله برای خود وکیل واقع شده است", [9], false, ""),
    new Answer(34, " معامله برای اصیل واقع شده است", [9], false, ""),
];
